---
id: 24e66452-2aaa-455f-b0c6-a0d8216bbe79
name: Entropy for Processes for a given Host (Normalized Process Events)
description: |
  'Entropy calculation used to help identify Hosts where they have a high variety of processes(a high entropy process list on a given Host over time).
  This helps us identify rare processes on a given Host. Rare here means a process shows up on the Host relatively few times in the the last 7days.
  The Weight is calculated based on the Entropy, Process Count and Distinct Hosts with that Process. The lower the Weight/ProcessEntropy the, more interesting.
  The Weight calculation increases the Weight if the process executes more than once on the Host or has executed on more than 1 Hosts.
  In general, this should identify processes on a Host that are rare and rare for the environment.
  References: https://medium.com/udacity/shannon-entropy-information-gain-and-picking-balls-from-buckets-5810d35d54b4
  https://en.wiktionary.org/wiki/Shannon_entropy'
requiredDataConnectors: []
tactics:
  - Execution
query: "```kusto\n// exclude when over # of machines have the process\nlet excludeThreshold = 10;\n// exclude when more than percent (default 10%)\nlet ratioHighCount = 0.1;\n// exclude when less than percent (default 3%)\nlet ratioMidCount = 0.03;\n// Process count limit in one day per machine, perf improvement (default every 20 minutes for 24 hours - 3*24 = 72)\nlet procLimit = 3*24;\n// Decrease possibility of hitting memory limit by removing high process count items across all machines (default every 10 minutes for 24 hours - 6*24 = 144)\nlet maxLimit = 6*24;\nlet removeHigh = imProcessCreate \n| where TimeGenerated >= ago(1d)\n| extend TargetProcessFilePath = TargetProcessName\n| summarize count() by TargetProcessFilePath = tolower(TargetProcessFilePath) | where count_ > maxLimit\n| summarize make_set(TargetProcessFilePath, 200);\nlet SecEvents = imProcessCreate\n| where TimeGenerated >= ago(1d)\n| extend TargetProcessFilePath = TargetProcessName\n| extend ActingProcessFileName = ActingProcessName\n| extend TargetProcessFileName = TargetProcessFileProduct\n| where tolower(TargetProcessFilePath) !in~ (removeHigh)\n// removing common items that may still show up in small environments, add here if you have additional exclusions \n| where TargetProcessFilePath !has ':\\\\Windows\\\\System32\\\\conhost.exe' and ActingProcessFileName !has ':\\\\Windows\\\\System32\\\\conhost.exe' \n| where ActingProcessFileName !has ':\\\\Windows\\\\System32\\\\wuauclt.exe' and TargetProcessFilePath !has':\\\\Windows\\\\System32\\\\wuauclt.exe' and TargetProcessFilePath !startswith 'C:\\\\Windows\\\\SoftwareDistribution\\\\Download\\\\Install\\\\AM_Delta_Patch_' \n| where ActingProcessFileName !has ':\\\\WindowsAzure\\\\GuestAgent_' and TargetProcessFilePath !has ':\\\\WindowsAzure\\\\GuestAgent_' \n| where ActingProcessFileName !has ':\\\\WindowsAzure\\\\WindowsAzureNetAgent_' and TargetProcessFilePath !has ':\\\\WindowsAzure\\\\WindowsAzureNetAgent_' \n| where ActingProcessFileName !has ':\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\platform\\\\' and TargetProcessFilePath !has \"\\\\Windows Defender Advanced Threat Protection\\\\SenseCncProxy.exe\" and TargetProcessFilePath !has \"\\\\Windows Defender Advanced Threat Protection\\\\SenseIR.exe.exe\" \n| where TargetProcessFilePath !has ':\\\\ProgramData\\\\Microsoft\\\\Windows Defender\\\\platform\\\\' \n| where TargetProcessFilePath !has ':\\\\Windows\\\\Microsoft.NET\\\\Framework' and not(TargetProcessFilePath endswith '\\\\ngentask.exe' or TargetProcessFilePath endswith '\\\\ngen.exe') \n| where ActingProcessFileName !has ':\\\\Windows\\\\Microsoft.NET\\\\Framework' and not(ActingProcessFileName endswith '\\\\ngentask.exe' or ActingProcessFileName endswith '\\\\ngen.exe') \n| where TargetProcessFilePath !has ':\\\\Windows\\\\System32\\\\taskhostw.exe' and ActingProcessFileName !has ':\\\\Windows\\\\System32\\\\taskhostw.exe' \n| where ActingProcessFileName !has ':\\\\Windows\\\\SoftwareDistribution\\\\Download\\\\Install\\\\' and not(TargetProcessFilePath endswith '\\\\MpSigStub.exe') \n| where TargetProcessFilePath !has ':\\\\Program Files\\\\Microsoft Monitoring Agent\\\\Agent\\\\Health Service State\\\\' and ActingProcessFileName !has ':\\\\Program Files\\\\Microsoft Monitoring Agent\\\\Agent\\\\MonitoringHost.exe' \n| where TargetProcessFilePath !has ':\\\\Windows\\\\servicing\\\\trustedinstaller.exe' \n| where ActingProcessFileName !has ':\\\\Program Files\\\\Microsoft Dependency Agent\\\\bin\\\\MicrosoftDependencyAgent.exe' \n| where ActingProcessFileName !has ':\\\\Program Files (x86)\\\\Microsoft\\\\EdgeUpdate\\\\MicrosoftEdgeUpdate.exe'\n| project TimeGenerated, EventOriginalUid, DvcHostname, ActorUserId, User, TargetProcessFileName, TargetProcessFilePath, TargetProcessCommandLine, ActingProcessFileName, _ResourceId, DvcId, EventVendor, EventProduct;\nlet Exclude = SecEvents \n| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), ExcludeCompCount = dcount(DvcHostname), ExcludeProcCount = count() by TargetProcessFileName \n// Removing general limit for noise in one day \n| extend timediff = iff(datetime_diff('day', EndTime, StartTime) > 0, datetime_diff('day', EndTime, StartTime), 1) \n// Default exclude of 48 (2 per hour) or more executions in 24 hours on a given machine \n| where ExcludeProcCount > procLimit*timediff \n// Removing noisy processes for an environment, adjust as needed \n| extend compRatio = ExcludeCompCount/toreal(ExcludeProcCount) \n| where compRatio == 0 or (ExcludeCompCount > excludeThreshold and compRatio < ratioHighCount) or (ExcludeCompCount between (2 .. excludeThreshold) and compRatio < ratioMidCount);\nlet AllSecEvents =  \nSecEvents | project DvcHostname, TargetProcessFileName , EventVendor, EventProduct\n| join kind= leftanti (  \nSecEvents \n// Removing general limit for noise in one day \n| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), procCount = count() by DvcHostname, TargetProcessFileName \n| extend timediff = iff(datetime_diff('day', EndTime, StartTime) > 0, datetime_diff('day', EndTime, StartTime), 1) \n// Default exclude 48 (2 per hour) or more executions in 24 hours on a given machine to remove them from overall comparison list \n| where procCount > procLimit*timediff \n) on DvcHostname, TargetProcessFileName \n| project DvcHostname, TargetProcessFileName , EventVendor, EventProduct;\n// Removing noisy process from full list \nlet Include = materialize(AllSecEvents \n| join kind= leftanti ( \nExclude \n) on TargetProcessFileName);\n// Identifying prevalence for a given process in the environment \nlet DCwPC = materialize(Include \n| summarize DistinctHostsProcessCount = dcount(DvcHostname) by TargetProcessFileName \n| join kind=inner ( \nInclude \n) on TargetProcessFileName \n| distinct DvcHostname, TargetProcessFileName, DistinctHostsProcessCount);\n// Getting the Total process count on each host to use as the denominator in the entropy calc \nlet AHPC = materialize(Include \n| summarize AllHostsProcessCount = count() by DvcHostname \n| join kind=inner ( \nInclude \n) on DvcHostname \n| distinct DvcHostname, TargetProcessFileName, AllHostsProcessCount \n//Getting a decimal value for later computation \n| extend AHPCValue = todecimal(AllHostsProcessCount));\n// Need the count of each class in my bucket or also said as count of ProcName(Class) per Host(Bucket) for use in the entropy calc \nlet PCoH = Include \n| summarize ProcessCountOnHost = count() by DvcHostname, TargetProcessFileName \n| join kind=inner ( \nInclude \n) on DvcHostname,TargetProcessFileName \n| distinct DvcHostname, TargetProcessFileName, ProcessCountOnHost \n//Getting a decimal value for later computation \n| extend PCoHValue = todecimal(ProcessCountOnHost); \nlet Combined = DCwPC \n| join ( \nAHPC \n) on DvcHostname, TargetProcessFileName \n| join ( \nPCoH \n) on DvcHostname, TargetProcessFileName;\nlet Results = Combined \n// Entropy calculation \n| extend ProcessEntropy = -log2(PCoHValue/AHPCValue)*(PCoHValue/AHPCValue) \n// Calculating Weight, see details in description \n| extend Weight = toreal(ProcessEntropy*ProcessCountOnHost*DistinctHostsProcessCount) \n// Remove or increase value to see processes with low entropy, meaning more common. \n| where Weight <= 100\n| project DvcHostname, TargetProcessFileName, Weight , ProcessEntropy, AllHostsProcessCount, ProcessCountOnHost, DistinctHostsProcessCount; \n// Join back full entry \nResults \n| join kind= inner ( \nSecEvents\n| project TimeGenerated, EventOriginalUid, DvcHostname, ActorUserId, TargetProcessFileName, User, TargetProcessFilePath, TargetProcessCommandLine, ActingProcessFileName, _ResourceId, DvcId , EventVendor, EventProduct\n) on DvcHostname, TargetProcessFileName \n| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), ResultCount = count() by EventOriginalUid, User, DvcHostname, ActorUserId, Weight, ProcessEntropy,  \nTargetProcessFileName, TargetProcessFilePath, TargetProcessCommandLine, ActingProcessFileName, AllHostsProcessCount, ProcessCountOnHost, DistinctHostsProcessCount, _ResourceId, DvcId , EventVendor, EventProduct\n| project-reorder StartTime, EndTime, ResultCount, EventOriginalUid, EventVendor, EventProduct, DvcHostname, User, ActorUserId, Weight, ProcessEntropy,TargetProcessFileName, TargetProcessFilePath, TargetProcessCommandLine, ActingProcessFileName, AllHostsProcessCount, ProcessCountOnHost, DistinctHostsProcessCount, _ResourceId, DvcId\n| sort by Weight asc, ProcessEntropy asc, TargetProcessFilePath asc \n| extend timestamp = StartTime, NTDomain = tostring(split(Account,'\\\\',0)[0]), Name = tostring(split(Account,'\\\\',1)[0])\n| extend HostName = tostring(split(DvcHostname, '.', 0)[0]), DnsDomain = tostring(strcat_array(array_slice(split(DvcHostname, '.'), 1, -1), '.'))\n| extend Account_0_Name = Name\n| extend Account_0_NTDomain = NTDomain\n| extend Host_0_HostName = HostName\n| extend Host_0_DnsDomain = DnsDomain\n```"
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: Name
      - identifier: NTDomain
        columnName: NTDomain
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: HostName
      - identifier: DnsDomain
        columnName: DnsDomain
version: 1.0.0
---

