---
id: 7323d9ca-ebf9-42da-a57b-015969fbd660
name: Firewall Policy Design Assistant
description: |
  This query helps you design client firewall rules based on data stored within DeviceNetworkEvents. Folder paths are alias'ed to help represent the
  files making or receiving network connections without dealing with duplication from path variance due to different root drive letter or user profile
  association.
  To make the report easy to read, inbound remote IP addresses are not calculated by default (this can be changed by setting the value of IncludeInboundRemoteIPs to true).
  Also, the ephemeral range is defaulted to 49152 to help eliminate false detections.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceNetworkEvents
tactics:
  - Misconfiguration
query: "```kusto\nlet EphemeralRangeStart = 49152;\nlet IncludeInboundRemoteIPs = false;\nlet AliasPath = (SourcePath:(FolderPath:string, FileName:string))\n{\nSourcePath\n    | extend AliasPath = tolower(\n            case(\n                //Modern style profile\n                FolderPath startswith 'c:\\\\users\\\\', strcat('%UserProfile%', substring(FolderPath, indexof(FolderPath,'\\\\',11), strlen(FolderPath) - 11)),\n                //Legacy style profile\n                FolderPath startswith 'c:\\\\documents and settings\\\\', strcat('%UserProfile%', substring(FolderPath, indexof(FolderPath,'\\\\',27), strlen(FolderPath) - 27)),\n                //Windir\n                FolderPath contains @':\\Windows\\', strcat('%windir%', substring(FolderPath, 10)),\n                //ProgramData\n                FolderPath contains @':\\programdata\\', strcat('%programdata%', substring(FolderPath, 14)),\n                // ProgramFiles\n                FolderPath contains @':\\Program Files\\', strcat('%ProgramFiles%', substring(FolderPath, 16)),\n                // Program Files (x86)\n                FolderPath contains @':\\Program Files (x86)\\', strcat('%ProgramFilesx86%', substring(FolderPath, 22)),\n                //Other\n               FolderPath)\n        )\n};\nlet ServerConnections =\n    DeviceNetworkEvents\n    | where ActionType in ('InboundConnectionAccepted','ListeningConnectionCreated')\n        and RemoteIPType != 'Loopback' \n        and LocalIP != RemoteIP \n        and RemoteIP !startswith '169.254' \n        and LocalPort < EphemeralRangeStart\n    | distinct DeviceId, InitiatingProcessFolderPath, LocalPort;\nunion (\n    DeviceNetworkEvents\n    | where ActionType in ('InboundConnectionAccepted','ListeningConnectionCreated','ConnectionSuccess','ConnectionFound','ConnectionRequest')\n        and RemoteIPType != 'Loopback' \n        and LocalIP != RemoteIP \n        and RemoteIP !startswith '169.254' \n        and LocalPort < EphemeralRangeStart\n    | join kind=leftsemi ServerConnections on DeviceId, InitiatingProcessFolderPath, LocalPort\n    | project-rename FolderPath = InitiatingProcessFolderPath, FileName = InitiatingProcessFileName\n    | invoke AliasPath()\n    | extend Directionality = 'Inbound', Port = LocalPort, RemoteIP = iff(IncludeInboundRemoteIPs == true, RemoteIP,'')\n),(\n    DeviceNetworkEvents\n    | where ActionType in ('ConnectionSuccess','ConnectionFound','ConnectionRequest') \n        and RemoteIPType != 'Loopback' \n        and LocalIP != RemoteIP \n        and RemoteIP !startswith '169.254' \n        and LocalPort >= EphemeralRangeStart\n    | join kind=leftanti ServerConnections on DeviceId, InitiatingProcessFolderPath, LocalPort\n    | project-rename FolderPath = InitiatingProcessFolderPath, FileName = InitiatingProcessFileName\n    | invoke AliasPath()\n    | extend Directionality = 'Outbound', Port = RemotePort\n)\n| summarize ConnectionCount = count(), DistinctMachines = dcount(DeviceId), Ports = makeset(Port), RemoteIPs = makeset(RemoteIP) by Directionality, AliasPath\n```"
---

