---
id: 132beb12-7146-45a5-9132-c82feee53b71
name: MITRE - Suspicious Events
description: |
  Description:.
  The query looks for several different MITRE techniques, grouped by risk level.
  A weighting is applied to each risk level and a total score calculated per machine.
  Techniques can be added/removed as required.
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceProcessEvents
query: "```kusto\nlet weights = dynamic({\"Low\":1, \"Medium\":3, \"High\":5}); //Assign weights to the risk levels\n//Low risk events\nlet lowRiskEvents =\n    DeviceProcessEvents \n    | where\n        (FileName =~ \"powershell.exe\" and ProcessCommandLine has \"-command\") //T1086 PowerShell\n        or\n        (FileName =~ \"powershell.exe\" and ProcessCommandLine contains \"-nop\") //T1086 PowerShell\n        or\n        (FileName =~ \"schtasks.exe\" and ProcessCommandLine has \"create\") //T1053 Scheduled Task\n        or\n        (FileName =~ \"installutil.exe\") //T1118 InstallUtil\n        or\n        (FileName =~ \"msbuild.exe\") //T1127 Trusted Developer Utilities\n        or\n        (FileName =~ \"nbtstat.exe\") //T1016 System Network Configuration Discovery\n        or\n        (FileName == \"mshta.exe\") //T1170 Mshta\n        or\n        (FileName =~ \"netsh.exe\") //T1089 Disabling Security Tools, T1063 Security Software Discovery\n        or\n        (FileName == \"net.exe\" and ProcessCommandLine has \" start \") //T1007 System Service Discovery\n    | extend Weight = toint((weights[\"Low\"]));\n//Medium risk events\nlet mediumRiskEvents =\n    DeviceProcessEvents \n    | where\n        (FileName =~ \"regsvcs.exe\") //T1121 Regsvcs/Regasm\n        or\n        (FileName =~ \"arp.exe\" and ProcessCommandLine has \"-a\") //T1016 System Network Configuration Discovery\n        or\n        (FileName =~ \"ipconfig.exe\" and ProcessCommandLine has \"all\") //T1016 System Network Configuration Discovery\n        or\n        (FileName startswith \"psexe\") //T1035 Service Execution\n        or\n        (FileName == \"net.exe\" and ProcessCommandLine has \" share \") //T1135 Network Share Discovery\n        or\n        (FileName =~ \"netsh.exe\" and ProcessCommandLine has \"interface show\") //T1016 System Network Configuration Discovery\n    | extend Weight = toint((weights[\"Medium\"]));\n//Higher risk events\nlet highRiskEvents =\n    DeviceProcessEvents \n    | where\n        (FileName =~ \"net.exe\" and ProcessCommandLine has \"config\") //T1016 System Network Configuration Discovery\n        or\n        (FileName =~ \"net.exe\" and ProcessCommandLine has \"time\") //T1124 System Time Discovery\n        or \n        (FileName =~ \"w32tm.exe\" and ProcessCommandLine has \"/tz\") //T1124 System Time Discovery\n        or\n        (FileName == \"cmstp.exe\") //T1191 CMSTP\n        or\n        (FileName =~ \"netsh.exe\" and (ProcessCommandLine has \"portproxy\" or ProcessCommandLine has \"p\")) //T1090 Connection Proxy\n    | extend Weight = toint((weights[\"High\"]));\nunion kind=outer lowRiskEvents, mediumRiskEvents, highRiskEvents\n| project Timestamp, DeviceName, FileName, ProcessCommandLine, InitiatingProcessCommandLine, Weight\n| summarize Start_Time=min(Timestamp), End_Time=max(Timestamp), Weight_Sum=sum(Weight), Processes=makeset(FileName), Commands=makeset(ProcessCommandLine) by DeviceName\n| where Weight_Sum > 30\n| sort by Weight_Sum desc \n```"
---

